//Написать программу вычисления значения функции y = f(a)
Console.Write("Левая граница отрезка a = ");
double a = Convert.ToDouble(Console.ReadLine());
Console.Write("Правая граница отрезка b = ");
double b = Convert.ToDouble(Console.ReadLine());
Console.Write("Количество точек n = ");
int n = Convert.ToInt32(Console.ReadLine());
Console.WriteLine();
//Есть нюансы (программа не работает)